["second", "https://www.wittyfeed.com/story/61677/benefits-of-doing-namaz", "What Are Some Unknown Benefits Of Doing Namaz Or \nSalat?  ", "Dalai Lama once said, \"Calm mind brings inner \nstrength and self-confidence, so that's very \nimportant for good health.\" ", "Do you know our everyday doings mark a serious \nimpact on our health? ", "Yes, they do, and that is why our ingenious \nancestors had forged some iron-fisted activities \nto our daily schedule. ", "Apart from religious factor, our ancestors had \nrealized different benefits of doing Namaz. ", "They had considered it as one of the best ways of \nfocusing on health and mind. ", "Start churning through the story. ", "There is a ritual that you have to wash your \nhands and feet before going for Namaz. ", "People prefer to do Namaz five times a day, \ncertainly wiping off germs and bacteria every \ntime they put their feet and hands under the tap. ", "The standing posture of Namaz is called Qiyam, \nwhich regulates the blood in the lower body \nportion. ", "This also helps in maintaining the strength of \nthe muscles, especially of the legs. ", "We all know how Yoga is important for our body \nand mind. ", "The postures people make while doing Namaz \nsomehow connect with the postures made in some \nYoga Asanas. ", "It is true that a person should do meditation for \nat least ten minutes a day. ", "This enhances the thinking process and gives \nstrength to the mind. ", "Extra calories are burnt if you strictly follow \nthe procedure of Namaz. ", "It is considered as one of the effective methods \nof weight loss. ", "The positions in Namaz give a boost to the \nflexibility of the body and slash down the \nstiffness. ", "This posture of Namaz reduces the pain in the \nmuscles, hence, giving you relief from arthritis \npain. ", "This posture is really great for your lower \nvertebral column. ", "It also helps in exerting abdominal pressure, \nhence, giving comfort to constipation and \nperistaltic movements. ", "The position of bending and touching your \nforehead to the ground is known as Sajdah. ", "This perfect position helps you in keeping your \nspine straight and erect. ", "This posture refreshes and eliminates the chances \nof a headache or a migraine. ", "This gives relaxation to the shoulder and upper \nback muscles. "]