["second", "https://www.wittyfeed.com/story/62872/sonakshi-sinha-lookalike-kanika-arora", "Our Dabangg Girl Has A Lookalike And Her Pictures \nAre Sure To Blow Your Mind ", "Some call them lookalikes, while others call them \ndoppelganger, either way, these are people who \nlook very similar to each other. ", "It is said that each person has at least 6 \nlookalikes around the world. ", "Similarly, when one spots a lookalike of a \nBollywood celebrity, it is bound to be the talk \nof the of the town. ", "One such case is of the Bollywood diva, Sonakshi \nSinha. ", "Even we were when we saw her for the first time. ", "Kanika Arora is a New York-based make up artist \nand looks exactly like Sonakshi Sinha. ", "And guess what they have never met each other. ", "Is it just us or they really do have a similar \ntaste in fashion too? ", "It is as if they take each other's advice on what \nto wear. ", "The jawlines of the two ladies match as well. ", "We are still wondering whether they are sisters \nwho got separated in some fair or something? ", "Kanika Arora is very active on Instagram, under \nthe username @beautybykanika. ", "Here she showcases her talent as a make up \nartist. ", "Just like Katrina Kaif's lookalike Zarine Khan \nand Aishwarya Rai's lookalike Sneha Ullal got a \nbreak in Bollywood, don't you think Kanika should \ntry her hand in the film industry as well? ", "What if Kanika Arora walks in front of you? ", "Would you be able to tell the difference or you \nwill fall into the trap of believing that it is \nSonakshi Sinha? ", "There is no doubt that Sonakshi loves to wear a \nbindi and has often been seen wearing one both in \nmovies and real life. ", "When her lookalike also sported the same \naccessory, man, it looked like Sonakshi's mirror \nimage. ", "While Sonakshi has been seen as a reel life wife \nseveral times, Kanika, on the other hand is a \nreal life wife who got married over a year ago. ", "Honestly, she looks like a diva already. ", "Even if we see her in Bollywood later, we think \nwill rock it for sure.Did you like the story? "]